var arr = [
{"pro":"北京","city":"北京","shop":"北京中汽雷日汽车有限公司|###|1|###|20001|###|20023"},
{"pro":"北京","city":"北京","shop":"北京长久博宇汽车销售服务有限公司|###|1|###|20001|###|25029"},
{"pro":"陕西","city":"宝鸡","shop":"宝鸡嘉诺汽车销售服务有限公司|###|10|###|20065|###|07552"},
{"pro":"陕西","city":"汉中","shop":"汉中三星金诺汽车销售服务有限责任公司|###|10|###|20066|###|07538"},
{"pro":"陕西","city":"西安","shop":"陕西鑫泰广隆汽车销售有限公司|###|10|###|20070|###|07551"},
{"pro":"陕西","city":"西安","shop":"陕西赛威嘉诺汽车销售服务有限公司|###|10|###|20070|###|21126"},
{"pro":"陕西","city":"西安","shop":"陕西龙之诺汽车销售服务有限公司|###|10|###|20070|###|25136"},
{"pro":"山西","city":"太原","shop":"山西大昌汽车贸易有限公司|###|11|###|20080|###|25025"},
{"pro":"山西","city":"运城","shop":"山西诺维兰集团运城瑞诺汽车销售服务有限公司|###|11|###|20083|###|07527"},
{"pro":"宁夏","city":"银川","shop":"宁夏天汇新诺汽车销售服务有限公司|###|13|###|20101|###|07566"},
{"pro":"宁夏","city":"银川","shop":"银川恒信盛隆汽车销售服务有限公司|###|13|###|20101|###|07575"},
{"pro":"新疆","city":"乌鲁木齐","shop":"新疆众悦商贸有限公司|###|14|###|20116|###|21753"},
{"pro":"青海","city":"西宁","shop":"青海嘉业汽车销售服务有限公司|###|16|###|20132|###|02400"},
{"pro":"四川","city":"成都","shop":"四川劲凯车业有限公司|###|17|###|20136|###|07550"},
{"pro":"四川","city":"成都","shop":"东创建国汽车集团成都华宝汽车服务有限公司|###|17|###|20136|###|20995"},
{"pro":"四川","city":"乐山","shop":"乐山天盛汽车销售服务有限公司|###|17|###|20142|###|07581"},
{"pro":"四川","city":"眉山","shop":"眉山天盛汽车销售服务有限公司|###|17|###|20145|###|07510"},
{"pro":"四川","city":"南充","shop":"南充德诺孚车业有限公司|###|17|###|20148|###|25137"},
{"pro":"四川","city":"宜宾","shop":"宜宾市东雷汽车销售服务有限公司|###|17|###|20152|###|07556"},
{"pro":"云南","city":"昆明","shop":"云南云之诺汽车销售有限公司|###|18|###|20162|###|01140"},
{"pro":"贵州","city":"贵阳","shop":"贵州风景汽车销售服务有限公司|###|19|###|20174|###|20996"},
{"pro":"贵州","city":"遵义","shop":"遵义乾坤东诺汽车销售有限公司|###|19|###|20180|###|07511"},
{"pro":"上海","city":"上海","shop":"上海弘仑汽车销售服务有限公司|###|2|###|20002|###|07546"},
{"pro":"上海","city":"上海","shop":"上海汽车进出口有限公司|###|2|###|20002|###|21688"},
{"pro":"上海","city":"上海","shop":"上海瀚龙依诺汽车销售有限公司|###|2|###|20002|###|25188"},
{"pro":"湖南","city":"长沙","shop":"湖南天和汽车销售服务有限公司|###|20|###|20181|###|21504"},
{"pro":"湖南","city":"长沙","shop":"湖南省逐鹿汽车销售贸易有限公司|###|20|###|20181|###|21731"},
{"pro":"湖南","city":"常德","shop":"常德双星经贸发展有限公司|###|20|###|20182|###|03360"},
{"pro":"湖南","city":"怀化","shop":"怀化津湘天泽汽车销售服务有限公司|###|20|###|20185|###|07507"},
{"pro":"湖南","city":"株洲","shop":"株洲兰天雷丰汽车销售有限公司|###|20|###|20194|###|07543"},
{"pro":"湖北","city":"黄冈市","shop":"黄冈恒信之诺汽车销售服务有限公司|###|21|###|20197|###|07576"},
{"pro":"湖北","city":"黄石","shop":"黄石市新世界汽车贸易有限公司|###|21|###|20198|###|07569"},
{"pro":"湖北","city":"荆州","shop":"荆州法诺汽车销售有限公司|###|21|###|20200|###|07548"},
{"pro":"湖北","city":"十堰","shop":"十堰三环鄂通汽车有限公司|###|21|###|20201|###|07534"},
{"pro":"湖北","city":"随州","shop":"随州三环诚通汽车有限公司|###|21|###|20202|###|07570"},
{"pro":"湖北","city":"武汉","shop":"武汉市法雷汽车销售服务有限公司|###|21|###|20203|###|01120"},
{"pro":"湖北","city":"武汉","shop":"东风鸿泰沌阳武汉汽车销售服务有限公司|###|21|###|20203|###|07562"},
{"pro":"湖北","city":"武汉","shop":"湖北三环鑫通汽车有限公司|###|21|###|20203|###|07571"},
{"pro":"湖北","city":"武汉","shop":"武汉恒信之诺汽车销售服务有限公司|###|21|###|20203|###|07573"},
{"pro":"湖北","city":"武汉","shop":"武汉市美诚汽车销售服务有限公司|###|21|###|20203|###|21130"},
{"pro":"湖北","city":"襄阳","shop":"襄阳法诺汽车销售服务有限公司|###|21|###|20205|###|01323"},
{"pro":"湖北","city":"宜昌","shop":"宜昌永诺汽车销售服务有限公司|###|21|###|20207|###|07544"},
{"pro":"河南","city":"濮阳","shop":"濮阳市雷曼汽车销售服务有限公司|###|22|###|20216|###|07545"},
{"pro":"河南","city":"商丘","shop":"商丘市佳德汽车销售服务有限公司|###|22|###|20218|###|07940"},
{"pro":"河南","city":"新乡","shop":"新乡市佳新汽车销售服务有限公司|###|22|###|20219|###|07920"},
{"pro":"河南","city":"许昌","shop":"许昌港源汽车销售服务有限公司|###|22|###|20221|###|07528"},
{"pro":"河南","city":"郑州","shop":"河南佳元汽车销售服务有限公司|###|22|###|20222|###|07520"},
{"pro":"河南","city":"郑州","shop":"河南天浩汽车销售有限公司|###|22|###|20222|###|07567"},
{"pro":"河南","city":"驻马店","shop":"驻马店市驿诺汽车销售有限公司|###|22|###|20224|###|07547"},
{"pro":"山东","city":"东营","shop":"东营雷法汽车销售服务有限公司|###|23|###|20227|###|07542"},
{"pro":"山东","city":"济南","shop":"山东世中汽车有限公司|###|23|###|20229|###|07506"},
{"pro":"山东","city":"济南","shop":"山东吉通汽车销售服务有限公司|###|23|###|20229|###|21012"},
{"pro":"山东","city":"济宁","shop":"济宁英汇汽车销售服务有限公司|###|23|###|20230|###|25173"},
{"pro":"山东","city":"临沂","shop":"临沂腾华汽车销售服务有限公司|###|23|###|20233|###|07585"},
{"pro":"山东","city":"青岛","shop":"青岛诺德行汽车销售有限公司|###|23|###|20234|###|07535"},
{"pro":"山东","city":"青岛","shop":"青岛东联汽车销售有限公司|###|23|###|20234|###|21136"},
{"pro":"山东","city":"日照","shop":"日照腾华汽车销售服务有限公司|###|23|###|20235|###|07584"},
{"pro":"山东","city":"威海","shop":"威海永昌汽车销售服务有限公司|###|23|###|20237|###|07577"},
{"pro":"山东","city":"烟台","shop":"烟台弘信汽车销售服务有限公司|###|23|###|20239|###|07521"},
{"pro":"山东","city":"淄博","shop":"淄博绿茵汽车销售有限公司|###|23|###|20241|###|25133"},
{"pro":"安徽","city":"阜阳","shop":"阜阳华智汽车销售服务有限公司|###|24|###|20248|###|07530"},
{"pro":"安徽","city":"合肥","shop":"合肥法雷汽车销售有限公司|###|24|###|20249|###|09780"},
{"pro":"安徽","city":"合肥","shop":"安徽铭晟车业有限公司|###|24|###|20249|###|21017"},
{"pro":"安徽","city":"六安","shop":"六安市雷力汽车销售服务有限公司|###|24|###|20253|###|07540"},
{"pro":"江苏","city":"南京","shop":"江苏东联汽车销售服务有限公司|###|25|###|20265|###|07572"},
{"pro":"江苏","city":"常州","shop":"常州中天日丰汽车销售服务有限公司|###|25|###|20260|###|07549"},
{"pro":"江苏","city":"常州","shop":"常州苏诺汽车销售服务有限公司|###|25|###|20260|###|21018"},
{"pro":"江苏","city":"江阴","shop":"江阴市全顺海诺汽车销售服务有限公司|###|25|###|20262|###|25175"},
{"pro":"江苏","city":"南京","shop":"南京宝铁龙宁诺汽车销售服务有限公司|###|25|###|20265|###|25056"},
{"pro":"江苏","city":"南通","shop":"江苏大生吉诺汽车销售服务有限公司|###|25|###|20266|###|03540"},
{"pro":"江苏","city":"苏州","shop":"苏州元诺汽车销售服务有限公司|###|25|###|20267|###|07539"},
{"pro":"江苏","city":"苏州","shop":"苏州开诺汽车销售服务有限公司|###|25|###|20267|###|07563"},
{"pro":"江苏","city":"苏州","shop":"苏州苏诺汽车销售服务有限公司|###|25|###|20267|###|21133"},
{"pro":"江苏","city":"泰州","shop":"泰州市海鹏汽车销售服务有限公司|###|25|###|20269|###|07080"},
{"pro":"江苏","city":"无锡","shop":"无锡市东方驰诺汽车销售服务有限公司|###|25|###|20270|###|21689"},
{"pro":"江苏","city":"徐州","shop":"徐州金诺汽车贸易有限公司|###|25|###|20271|###|21748"},
{"pro":"江苏","city":"盐城","shop":"江苏森风礼德汽车有限公司|###|25|###|20272|###|25176"},
{"pro":"江苏","city":"扬州","shop":"扬州东峻天诺汽车销售服务有限公司|###|25|###|20273|###|07574"},
{"pro":"江苏","city":"张家港","shop":"张家港市启诺汽车销售服务有限公司|###|25|###|20275|###|07565"},
{"pro":"浙江","city":"杭州","shop":"杭州众新泰汽车销售服务有限公司|###|26|###|20278|###|07260"},
{"pro":"浙江","city":"杭州","shop":"杭州爱卡汽车维修服务有限公司|###|26|###|20278|###|21666"},
{"pro":"浙江","city":"金华","shop":"金华金诺汽车销售有限公司|###|26|###|20281|###|25140"},
{"pro":"浙江","city":"宁波","shop":"宁波市海曙博纳汽车销售服务有限公司|###|26|###|20283|###|21131"},
{"pro":"浙江","city":"瑞安","shop":"温州汇达汽车销售服务有限公司|###|26|###|20285|###|21132"},
{"pro":"浙江","city":"台州","shop":"台州升驰汽车销售服务有限公司|###|26|###|20287|###|07568"},
{"pro":"浙江","city":"台州","shop":"台州元现汽车有限公司|###|26|###|20287|###|07580"},
{"pro":"天津","city":"天津","shop":"天津众兴汽车贸易有限公司|###|3|###|20003|###|21137"},
{"pro":"广东","city":"东莞","shop":"东莞市东裕汽车销售服务有限公司|###|30|###|20302|###|07578"},
{"pro":"广东","city":"东莞","shop":"东莞市大兴汽车贸易有限公司|###|30|###|20302|###|20997"},
{"pro":"广东","city":"广州","shop":"广州广之诺汽车销售服务有限公司|###|30|###|20305|###|21506"},
{"pro":"广东","city":"广州","shop":"广东粤兴汽车贸易有限公司|###|30|###|20305|###|21750"},
{"pro":"广东","city":"惠州","shop":"惠州市上居汽车销售服务有限公司|###|30|###|20308|###|07522"},
{"pro":"广东","city":"深圳","shop":"深圳市瑞华汽车贸易有限公司|###|30|###|20317|###|21700"},
{"pro":"广东","city":"中山","shop":"中山艮泽汽车销售服务有限公司|###|30|###|20323|###|07512"},
{"pro":"广东","city":"珠海","shop":"珠海市众鑫诺汽车销售服务有限公司|###|30|###|20324|###|07523"},
{"pro":"广西","city":"桂林","shop":"桂林华诺汽车销售服务有限公司|###|31|###|20330|###|07559"},
{"pro":"广西","city":"柳州","shop":"柳州海腾汽车销售服务有限公司|###|31|###|20334|###|07557"},
{"pro":"广西","city":"南宁","shop":"广西华诺汽车销售有限公司|###|31|###|20335|###|20103"},
{"pro":"江西","city":"赣州","shop":"赣州兴华工贸有限公司|###|32|###|20340|###|07240"},
{"pro":"江西","city":"南昌","shop":"江西友缘汽车销售服务有限公司|###|32|###|20344|###|07508"},
{"pro":"福建","city":"福州","shop":"福州齐力汽车销售服务有限公司|###|33|###|20350|###|03520"},
{"pro":"福建","city":"福州","shop":"福建省汇京雷神汽车销售服务有限公司|###|33|###|20350|###|07524"},
{"pro":"福建","city":"厦门","shop":"厦门市恒晋贸易有限公司|###|33|###|20358|###|21011"},
{"pro":"海南","city":"海口","shop":"海南瀚龙宝诺汽车销售有限公司|###|34|###|20360|###|25139"},
{"pro":"重庆","city":"重庆","shop":"重庆泰诺汽车销售有限公司|###|4|###|20004|###|05380"},
{"pro":"重庆","city":"重庆","shop":"重庆东方南方汽车销售服务有限公司雷诺分公司|###|4|###|20004|###|07541"},
{"pro":"黑龙江","city":"哈尔滨","shop":"黑龙江东顺汽车销售服务有限公司|###|5|###|20007|###|07583"},
{"pro":"黑龙江","city":"齐齐哈尔","shop":"齐齐哈尔尊诺汽车销售服务有限公司|###|5|###|20014|###|07509"},
{"pro":"辽宁","city":"沈阳市","shop":"辽宁省汽车贸易集团汽车销售有限公司|###|6|###|20029|###|07555"},
{"pro":"辽宁","city":"大连","shop":"大连龙驰汽车销售服务有限公司|###|6|###|20391|###|07537"},
{"pro":"辽宁","city":"大连","shop":"大连雷之诺汽车销售服务有限公司|###|6|###|20391|###|21147"},
{"pro":"吉林","city":"长春","shop":"长春市欧骐汽车销售服务有限公司|###|7|###|20034|###|07558"},
{"pro":"吉林","city":"长春","shop":"吉林通田汽车销售服务有限公司|###|7|###|20034|###|25194"},
{"pro":"河北","city":"保定","shop":"保定市凯辰汽车销售服务有限公司|###|8|###|20041|###|07460"},
{"pro":"河北","city":"沧州","shop":"沧州顺泰汽车销售服务有限公司|###|8|###|20042|###|07579"},
{"pro":"河北","city":"邢台","shop":"邢台劲龙汽车销售服务有限公司|###|8|###|20050|###|07564"},
{"pro":"内蒙古","city":"包头","shop":"包头市信得惠皓佳汽车销售服务有限公司|###|9|###|20054|###|25189"},
{"pro":"浙江","city":"嘉兴","shop":"嘉兴市百诺汽车有限公司|###|26|###|20280|###|07588"},
{"pro":"福建","city":"泉州","shop":"泉州市森然汽车发展有限公司|###|33|###|20356|###|07590"},
{"pro":"河北","city":"张家口","shop":"张家口鸿刚汽车销售服务有限公司|###|8|###|20051|###|07596"},
{"pro":"新疆","city":"乌鲁木齐","shop":"新疆汇众丰诺汽车销售服务有限公司|###|14|###|20116|###|07594"},
{"pro":"四川","city":"攀枝花","shop":"攀枝花凯雷吉诺汽车销售服务有限公司|###|17|###|20149|###|07587"},
{"pro":"云南","city":"保山","shop":"腾冲弘信雷之诺汽车销售服务有限公司|###|18|###|20155|###|07593"},
{"pro":"云南","city":"昆明","shop":"云南华福汽车销售服务有限公司|###|18|###|20162|###|07599"},
{"pro":"贵州","city":"安顺","shop":"安顺广润达汽车销售服务有限公司|###|19|###|20172|###|07589"},
{"pro":"贵州","city":"黔东南州","shop":"黔东南州广顺达汽车销售有限公司|###|19|###|20374|###|07597"},
{"pro":"湖南","city":"娄底","shop":"娄底天利汽车销售服务有限公司|###|20|###|20186|###|07610"},
{"pro":"湖北","city":"恩施","shop":"恩施麟泰汽车销售服务有限公司|###|21|###|20370|###|07592"},
{"pro":"山东","city":"济南","shop":"菏泽正泰汽车销售服务有限公司|###|23|###|20229|###|07598"},
{"pro":"山东","city":"潍坊","shop":"潍坊伟鹏汽车销售服务有限公司|###|23|###|20238|###|07591"},
{"pro":"江苏","city":"南通","shop":"海安华胜电子商务有限公司|###|25|###|20266|###|07611"},
{"pro":"江西","city":"赣州","shop":"江西祥子汽车销售服务有限公司|###|32|###|20340|###|07602"},
{"pro":"浙江","city":"温州","shop":"温州市俊泰贸易有限公司|###|26|###|20289|###|25015"},
{"pro":"上海","city":"上海","shop":"上海锦筝汽车销售服务有限公司|###|2|###|20002|###|07609"},
{"pro":"天津","city":"天津","shop":"天津鹏瑞龙汽车贸易有限公司|###|3|###|20003|###|07601"}


];


function getSheng(sid)
{
	var sheng = new Array();
	for(var i=0; i<arr.length; i++){	
		sheng[i] = arr[i].pro;
	}
	sheng = unique(sheng);
	//生成option
    document.getElementById(sid).options[0] = new Option("请选择省份", "");
    for (var i = 0; i < sheng.length; i++) {
        document.getElementById(sid).options[i + 1] = new Option(sheng[i], sheng[i]);
    }

	//return sheng;
}

function getShi(cid,sname)
{
	var shi = new Array();
	var s = 0;

	for(var i=0; i<arr.length; i++){
		if(arr[i].pro == sname)
		{
			shi[s] = arr[i].city;
			s++;
		}
	}
	shi = unique(shi);
	document.getElementById(cid).innerHTML = "";
    document.getElementById(cid).options[0] = new Option("请选择城市", "");
    for (var i = 0; i < shi.length; i++) {
        document.getElementById(cid).options[i + 1] = new Option(shi[i], shi[i]);
    }
}

function getShop(spid,cname)
{
	var shop = new Array();
	var s = 0;
	for(var i=0; i<arr.length; i++){
		if(arr[i].city == cname)
		{
			shop[s] = arr[i].shop;
			s++;
		}
	}
	shop = unique(shop);

//	alert(shop);
	document.getElementById(spid).innerHTML = "";
    document.getElementById(spid).options[0] = new Option("请选择经销商", "");
    for (var i = 0; i < shop.length; i++) {
        document.getElementById(spid).options[i + 1] = new Option(shop[i].split('|###|')[0], shop[i]);
    }

	//return shop;
}

function unique(arr) {
  var ret = []
  var hash = {}
  for (var i = 0; i < arr.length; i++) {
    var item = arr[i]
    var key = typeof(item) + item
    if (hash[key] !== 1) {
      ret.push(item)
      hash[key] = 1
    }
  }

  return ret
}

//<select id="shengid" onchange="getShi('cityid',this.value)"></select>
//<select id="cityid" onchange="getShop('shopid',this.value)"></select>
//<select id="shopid"></select>